Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [9]:
import pandas as pd
num = pd.Series([4,8,15,16,23,42])
num

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [10]:
import pandas as pd
var = [1,2,3,4,5,6,7,8,9,0]
pd.Series(var)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9    0
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

Then, print the DataFrame.

In [12]:
import pandas as pd
data = {"Name":["Alice","Bob","Claire"],
       "Age":[25,30,27],"Gender":["Female","Male","Female"]}
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans : In pandas DataFrame is a tabular structure having multiple coloumns and having datatype as dataframe and series is equivalent to list having single coloumns

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans: some common functions we can use to manipulate data in pandas dataframe are dtypes(),describe(),drop(),set_index(),reset_index(),dropna() etc

In [15]:
import pandas as pd
data = {"Name":["Alice","Bob","Claire"],
       "Age":[25,30,27],"Gender":["Female","Male","Female"]}
df = pd.DataFrame(data)
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

ans : DataFrame

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [21]:
import pandas as pd
l1 = [1,2,3,4,5,6]
l2 = [12,34,5,7,9,0]
df = pd.DataFrame({"r":l1,"s":l2})
df

   r   s
0  1  12
1  2  34
2  3   5
3  4   7
4  5   9
5  6   0